#language: ru

@tree

Функционал: Проверка создания клиента

Контекст:
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: Проверка создания клиента
	* Открытие формы создания клиена
		И я закрываю все окна клиентского приложения
		И В командном интерфейсе я выбираю 'Продажи' 'Контрагенты'
		Тогда открылось окно 'Контрагенты'
		И я нажимаю на кнопку с именем 'ФормаСоздать'
	* Заполнение наименования клиента
		И в поле с именем 'Наименование' я ввожу текст 'Тестовый контрагент'
		И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Оптовая'
	* Заполнение номера телефона клиента
		И в поле с именем 'Телефон' я ввожу текст '+79998887766'		
	* Сохранение
		И я нажимаю на кнопку с именем 'ФормаЗаписать'		
	* Проверка соранения по коду
		И я запоминаю значение поля "Код" как "Код"	
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Тестовый контрагент (Контрагент)' в течение 20 секунд
		Тогда таблица "Список" содержит строки:
			| 'Код'   |
			| '$Код$' |
			